[
    {
      "paths": 4,
      "minutes": 20,
      "description": "In this learning path, you will successfully install and configure Ansible plugins on Red Hat Developer Hub (RHDH), enhancing the automation capabilities within your development environment. This comprehensive guide provides you with the knowledge and steps needed to seamlessly integrate Ansible Automation with RHDH, ensuring a unified and efficient workflow for automation developers.",
      "label": "Install and Configure Ansible plug-ins for Red Hat Developer Hub on Developer Sandbox for Red Hat Openshift",
      "url": "https://developers.redhat.com/learn/ansible/install-and-configure-ansible-plug-ins-red-hat-developer-hub-developer-sandbox-red-hat-openshift"
    },
    {
      "paths": 7,
      "hours": 1,
      "minutes": 35,
      "description": "Learn how to onboard developers onto Red Hat Developer Hub, so they can import and use relevant templates and run the application on the development environment.",
      "label": "Application development with Red Hat Developer Hub",
      "url": "https://developers.redhat.com/learn/application-development-red-hat-developer-hub"
    },
    {
      "paths": 6,
      "hours": 2,
      "description": "Learn how to install the Red Hat Developer Hub internal developer platform and learn the concepts and skills you need to install your IDP, configure simple GitHub authorization, and explore templating basics.",
      "label": "Install and configure Red Hat Developer Hub and explore templating basics",
      "url": "https://developers.redhat.com/learn/openshift/install-and-configure-red-hat-developer-hub-and-explore-templating-basics"
    },
    {
      "paths": 11,
      "hours": 8,
      "description": "Developers working in cloud native teams face the challenge of shuffling between microservices, external APIs, libraries, and other software components. Developer portals like Backstage can help teams reduce tech fragmentation, knowledge silos, and lack of ownership while promoting creativity and autonomy.",
      "label": "Introduction to Backstage: Developer Portals Made Easy",
      "url": "https://training.linuxfoundation.org/training/introduction-to-backstage-developer-portals-made-easy-lfs142/"
    },
    {
      "paths": 3,
      "hours": 1,
      "minutes": 45,
      "description": "Learn everything you need to know about Backstage with a guide to take you step-by-step.",
      "label": "Spotify for Backstage",
      "url": "https://backstage.spotify.com/learn/"
    },
    {
      "paths": 5,
      "hours": 1,
      "description": "Podman Desktop is a lightweight and efficient tool for managing containers and working with Kubernetes from your Windows, macOS, or Linux machine. From building container images to working with registries and deploying containers, Podman Desktop helps you seamlessly work with containerization technology, and simplifies the transition to container deployment on Kubernetes. This learning path, created by Don Schenck, demonstrates how you can go from an initial application to a container to a fully running pod on Kubernetes using Podman Desktop and the no-cost Developer Sandbox for Red Hat OpenShift.",
      "label": "Develop containers using Podman Desktop and Kubernetes",
      "url": "https://developers.redhat.com/learn/develop-containers-using-podman-desktop-and-kubernetes"
    },
    {
      "paths": 8,
      "hours": 1,
      "minutes": 45,
      "description": "Gain a thorough understanding of the moving parts that make up the typical container architecture, including container images, registries, and orchestration.",
      "label": "Container Fundamentals",
      "url": "https://developers.redhat.com/learn/rhel/container-fundamentals"
    },
    {
      "paths": 1,
      "minutes": 50,
      "description": "Learn to deploy and control an already-defined container image.",
      "label": "Deploy containers using Podman",
      "url": "https://developers.redhat.com/learn/lessons/deploying-containers-podman"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "The goal of this track is to demonstrate how to copy files to and from a Persistent Volume.",
      "label": "Transferring Files in and out of Containers",
      "url": "https://developers.redhat.com/courses/transfer-files-and-out-containers"
    },
    {
      "paths": 1,
      "minutes": 41,
      "description": "Whether you are using the OpenShift web console or the command line, you will learn to deploy an application from a Container Image Using the Web Console and Command-Line.",
      "label": "Deploying Applications From Images",
      "url": "https://developers.redhat.com/courses/deploy-applications-images"
    },
    {
      "paths": 5,
      "hours": 1,
      "description": "The Developer Sandbox for Red Hat OpenShift is a great platform for learning and experimenting with Red Hat OpenShift. Because OpenShift is built on Kubernetes, the Sandbox is also a great platform for learning and experimenting with Kubernetes.",
      "label": "Learn Kubernetes using the Developer Sandbox for Red Hat OpenShift",
      "url": "https://developers.redhat.com/learn/openshift/learn-kubernetes-using-developer-sandbox-red-hat-openshift"
    },
    {
      "paths": 13,
      "hours": 3,
      "minutes": 40,
      "description": "Learn the foundations of OpenShift through hands-on experience deploying and working with applications, using a no-cost OpenShift cluster through the Developer Sandbox for Red Hat OpenShift.",
      "label": "Foundations of OpenShift",
      "url": "https://developers.redhat.com/learn/openshift/foundations-openshift"
    },
    {
      "paths": 4,
      "minutes": 45,
      "description": "Immerse yourself in practical aspects of OpenShift such as cluster access, file transfers, database operations, and resource management through interactive, hands-on labs.",
      "label": "Using OpenShift",
      "url": "https://developers.redhat.com/learn/openshift/using-openshift"
    },
    {
      "paths": 4,
      "hours": 1,
      "minutes": 5,
      "description": "Create, test, and deploy Java code to OpenShift in a seamless development workflow as well as learn to use Quarkus to write data driven applications using a variety of data sources with just a few lines of code.",
      "label": "DevOps on OpenShift",
      "url": "https://developers.redhat.com/learn/openshift/devops-openshift"
    },
    {
      "paths": 4,
      "minutes": 30,
      "description": "Without data, software has no value. Data needs to be created, stored, updated, and retrieved. One way to store persistent data in OpenShift is by using a Persistent Volume Claim (PVC). In this learning path, created by Don Schenck, you will learn how to create a PVC and access it with your pod.",
      "label": "Store persistent data in Red Hat OpenShift using PVCs",
      "url": "https://developers.redhat.com/learn/openshift/store-persistent-data-red-hat-openshift-using-pvcs"
    },
    {
      "paths": 4,
      "minutes": 45,
      "description": "Automated builds and deployments – known as CI/CD – of container-based applications can reduce mistakes, improve productivity, and promote more thorough testing. This learning path introduces OpenShift Pipelines for automated builds and deployment.",
      "label": "Using OpenShift Pipelines",
      "url": "https://developers.redhat.com/learn/openshift/using-openshift-pipelines"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "Learn about a new Go-based Operator with the Operator SDK by hands-on learning.",
      "label": "Operator SDK with Go",
      "url": "https://developers.redhat.com/courses/openshift-operators/go-operator"
    },
    {
      "paths": 18,
      "hours": 4,
      "minutes": 15,
      "description": "Everyone likes a camp romance. Argo Cd and Tekton are a match made in Kubernetes heaven. See what makes them tick!",
      "label": "From DevOps to GitOps",
      "url": "https://developers.redhat.com/devnation/devops-gitops"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "This track provides an introduction to cloud-native development with Node.js.",
      "label": "Developing with Node.js",
      "url": "https://developers.redhat.com/courses/developing-nodejs"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "This practice-based path shows you how to apply Atlassian's innovative teamwork philosophies and real-life tools. Each course was designed by Atlassian’s top work futurists and can be completed in under one hour.",
      "label": "Jira: Improve your team’s collaboration",
      "url": "https://university.atlassian.com/student/path/1427540-improve-your-team-s-collaboration?sid=64022b3f-a2e1-48f6-bc12-c2a3ac3e103d&sid_i=5"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "Jira Administrators are responsible for configuring Jira Software, Jira Work Management, and/or Jira Service Management, plus related apps and third-party tools.",
      "label": "Become an effective Jira Admin",
      "url": "https://university.atlassian.com/student/path/837213-become-an-effective-jira-admin?sid=64022b3f-a2e1-48f6-bc12-c2a3ac3e103d&sid_i=1"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "The following short, self-paced courses will teach you Jira basics, including key terms and concepts and how to navigate the interface. You’ll also learn how to organize your work using issues, collaborate with team members, and customize your Jira experience.",
      "label": "Get the most out of Jira",
      "url": "https://university.atlassian.com/student/collection/850385/path/1083901"
    },
    {
      "paths": 1,
      "hours": 2,
      "description": "The following short, self-paced courses will help you get up and running in Confluence quickly. You’ll learn how to create and find all your work in one central hub and use comments and mentions to make your team more transparent, efficient, and collaborative.",
      "label": "Get the most out of Confluence",
      "url": "https://university.atlassian.com/student/collection/850385/path/1083904"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "The following short, self-paced courses will help you get up and running in Jira Work Management quickly. You’ll learn key terms, how to navigate Jira Work Management, and how to apply best practices so you can start collaborating with your business teams.",
      "label": "Get started with Jira Work Management",
      "url": "https://university.atlassian.com/student/collection/850385/path/2135872"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "In the following short, self-paced courses, you’ll learn agile values, how they help teams drive success, and how to approach your everyday work with an agile mindset — no background knowledge or prerequisites required. You’ll learn how kanban and scrum frameworks can help you manage your work more efficiently and deliver maximum value to customers.",
      "label": "Apply agile practices to manage your work",
      "url": "https://university.atlassian.com/student/collection/850385/path/2809962"
    },
    {
      "paths": 1,
      "hours": 5,
      "description": "The following short, self-paced courses will help you customize Jira software projects according to your team’s needs.",
      "label": "Configure software projects to support team efficiency",
      "url": "https://university.atlassian.com/student/path/2118285-configure-software-projects-to-support-team-efficiency"
    },
    {
      "paths": 1,
      "hours": 1,
      "description": "This learning path will help you understand the principles, frameworks, and tools associated with DevOps. You will also learn how to optimize your DevOps workflow with Jira Software.",
      "label": "Jira: Optimize your DevOps workflow",
      "url": "https://university.atlassian.com/student/collection/850385/path/1062311"
    },
    {
      "paths": 3,
      "hours": 1,
      "description": "In this learning exercise, we will start OpenShift AI within the OpenShift cluster, guide you through accessing the OpenShift AI dashboard, and illustrate the procedure for retrieving a GitHub repository within the JupyterLab environment. Using JupyterLab, you will execute sample machine learning programs.",
      "label": "Introduction to OpenShift AI",
      "url": "https://developers.redhat.com/learn/openshift-ai/introduction-openshift-ai"
    },
    {
      "paths": 3,
      "hours": 1,
      "description": "This learning exercise delves into the end-to-end process of building and managing Machine Learning (ML) pipelines using the OpenShift AI. Through a highly structured guide, developers and platform engineers are led through each step required to construct an efficient pipeline. Beginning with data acquisition, the pipeline navigates seamlessly through model training, performance evaluation, and culminates in the storage of the trained model in Amazon S3. Furthermore, the exercise empowers developers to automate pipeline runs, streamlining the entire ML workflow.",
      "label": "Automation ML pipeline with OpenShift AI",
      "url": "https://developers.redhat.com/learning/learn:openshift-ai:automation-ml-pipeline-openshift-ai/resource/prerequisites-and-step-step-guide"
    },
    {
      "paths": 5,
      "hours": 1,
      "description": "Learn how to access a large language model using Node.js and LangChain.js. You’ll also explore LangChain.js APIs that simplify common requirements like retrieval-augmented generation (RAG).",
      "label": "How to get started with large language models and Node.js",
      "url": "https://developers.redhat.com/learn/openshift/how-get-started-large-language-models-and-nodejs"
    },
    {
      "paths": 5,
      "hours": 1,
      "description": "In this learning path we dig deeper into using large language models (LLMs) with Node.js by looking at Ollama, LlamaIndex, function calling, agents and observability with Open Telemetry.",
      "label": "Diving Deeper with large language models and Node.js",
      "url": "https://developers.redhat.com/learn/diving-deeper-large-language-models-and-nodejs"
    }
  ]